app/controllers/articles_controller.rb

INSERT INTO "articles" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-11-12 15:06:46.098356"], ["text", "ddd"], ["title", "aa"], ["updated_at", "2014-11-12 15:06:46.098356"]]
---
	def create
		@article = Article.new(article_params)	#Article model is initialized with its attributes

		if @article.save	#saves the model in the database

SELECT "articles".* FROM "articles"
---
	def index
		@articles = Article.all 	#convention to use plural for more articles

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "articles" SET "text" = ?, "updated_at" = ? WHERE "articles"."id" = 3  [["text", "si mai tare. Merge update?"], ["updated_at", "2014-11-12 18:06:46.412735"]]
---
	def update
		@article = Article.find(params[:id])

		if @article.update(article_params)	#updates the model in the database