app/controllers/comments_controller.rb

	def create
		@article = Article.find(params[:article_id])
		@comment = @article.comments.create(comments_params)
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("article_id", "body", "commenter", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["article_id", 2], ["body", "My first comment in Rails"], ["commenter", "Grigore"], ["created_at", "2014-11-12 18:51:44.353642"], ["updated_at", "2014-11-12 18:51:44.353642"]]